In [1]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_csv('df.csv').drop(['Unnamed: 0'],axis=1)
df

    count  expense
0      12    12000
1      11    11000
2      10    10000
3       9     9000
4       8     8000
5       7     7000
6       6     6000
7       5     5000
8       4     4000
9       3     3000
10      2     2000
11      1     1000

In [15]:
grouped_df = df.groupby(df.index // (12//3)).apply(lambda x: pd.Series({'count': x['count'].sum(), 'expense': x['expense'].sum()}))

# Display the grouped DataFrame
grouped_df

   count  expense
0     42    42000
1     26    26000
2     10    10000

In [16]:
grouped_df['average'] = grouped_df['expense']/grouped_df['count']

grouped_df

   count  expense  average
0     42    42000   1000.0
1     26    26000   1000.0
2     10    10000   1000.0

In [29]:
array = np.reshape(np.array(grouped_df), (9,))

array

array([4.2e+01, 4.2e+04, 1.0e+03, 2.6e+01, 2.6e+04, 1.0e+03, 1.0e+01,
       1.0e+04, 1.0e+03])